if OS.mac?
  # macOS-specific tools
  tap "homebrew/cask"
  tap "FelixKratz/formulae"

  brew "felizkratz/formulae/sketchybar"

  brew cask "hammerspoon"
  brew cask "kitty"
  brew cask "rectangle"
  brew cask "1password"
  brew cask "1password/tap/1password-cli" 

  # Fonts for macOS
  brew cask "font-jetbrains-mono"
  brew cask "font-jetbrains-mono-nerd-font"
  brew cask "font-meslo-lg"
  brew cask "font-meslo-lg-nerd-font"
  brew cask "font-victor-mono"
  brew cask "font-victor-mono-nerd-font"
  brew cask "font-symbols-only-nerd-font"

elsif OS.linux?
  # Linux-specific tools
  brew "xclip"
end

# Shared tools for all platforms
tap "homebrew/bundle"

brew "atuin"
brew "bat" 
brew "btop"
brew "git-delta"
brew "eza"
brew "fd" 
brew "fzf"
brew "gh"
brew "git"
brew "glow"
brew "fnm" 
brew "hyperfine"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "neovim" 
brew "ripgrep"
brew "stow"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "wifi-password"
brew "yarn"
brew "zellij"
brew "zoxide"
brew "zsh"

brew cask "brave-browser"
brew cask "docker"
brew cask "nordvpn"
brew cask "postman"
brew cask "spotify"
brew cask "wezterm"
