if OS.mac?
  # macOS-specific tools
  brew "hammerspoon" # Automate macOS using Lua
  brew "kitty" # Better terminal
  brew "rectangle" # Window manager
  brew "trash-cli" # Move files to trash
  brew "sketchybar" # Customizable MacOs status bar replacement
  brew "1password" # Password manager
  brew "1password/tap/1password-cli" # 1Password CLI

  # Fonts for macOS
  brew "font-jetbrains-mono"
  brew "font-jetbrains-mono-nerd-font"
  brew "font-meslo-lg"
  brew "font-meslo-lg-nerd-font"
  brew "font-victor-mono"
  brew "font-victor-mono-nerd-font"
  brew "font-symbols-only-nerd-font"

elsif OS.linux?
  # Linux-specific tools
  brew "xclip" # Clipboard management (similar to pbcopy/pbpaste)
end

# Shared tools for all platforms
tap "homebrew/bundle"

brew "atuin" # Enhanced shell history manager
brew "bat" # Cat clone with syntax highlighting
brew "btop" # Improved system monitoring tool
brew "brave-browser" # Brave browser
brew "delta" # Syntax highlighting for git
brew "docker" # Docker
brew "dooit" # Task manager
brew "eza" # Modern ls alternative
brew "fd" # Fast and user-friendly find
brew "fzf" # Fuzzy finder
brew "fzf-git" # Fuzzy finder for git
brew "gh" # GitHub CLI
brew "git" # Git
brew "glow" # Markdown viewer
brew "fnm" # Fast Node.js version manager
brew "hyperfine" # Command-line benchmarking tool
brew "jq" # JSON processor
brew "lazydocker" # Simplified Docker management
brew "lazygit" # Simplified Git UI
brew "neovim" # Neovim (modern Vim)
brew "nordvpn" # VPN client
brew "postman" # API testing client
brew "ripgrep" # Fast search tool (grep alternative)
brew "spotify" # Spotify client
brew "stow" # Symlink manager
brew "taskell" # Minimalist task management
brew "thefuck" # Corrects your previous console command.
brew "tldr" # Simplified man pages
brew "tmux" # Terminal multiplexer
brew "wezterm" # Modern terminal emulator
brew "wifi-password" # Retrieve saved Wi-Fi passwords
brew "yarn" # JavaScript package manager
brew "zellij" # Terminal workspace manager
brew "zoxide" # Smart directory navigation
brew "zsh" # Z shell
