if OS.mac?
  # macOS-specific tools
  tap "FelixKratz/formulae"
  tap "1password/tap"

  brew "sketchybar"

  cask "hammerspoon"
  cask "kitty"
  cask "rectangle"
  cask "1password"
  cask "1password/tap/1password-cli" 

  # Fonts for macOS
  cask "font-jetbrains-mono"
  cask "font-jetbrains-mono-nerd-font"
  cask "font-meslo-lg"
  cask "font-meslo-lg-nerd-font"
  cask "font-victor-mono"
  cask "font-victor-mono-nerd-font"
  cask "font-symbols-only-nerd-font"

elsif OS.linux?
  # Linux-specific tools
  brew "xclip"
end

# Shared tools for all platforms
tap "homebrew/bundle"

brew "atuin"
brew "bat" 
brew "btop"
brew "git-delta"
brew "eza"
brew "fd" 
brew "fzf"
brew "gh"
brew "git"
brew "glow"
brew "fnm" 
brew "hyperfine"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "neovim" 
brew "ripgrep"
brew "stow"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "wifi-password"
brew "yarn"
brew "zellij"
brew "zoxide"
brew "zsh"

cask "brave-browser"
cask "docker"
cask "nordvpn"
cask "postman"
cask "spotify"
cask "wezterm"
